In [1]:
import pandas as pd
import numpy as np

In [3]:
string_data = pd.Series(['aardvark','artichoke',np.nan, 'avocado'])

In [4]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [8]:
string_data[0] = None

In [9]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [10]:
string_data.dropna()

1    artichoke
3      avocado
dtype: object

In [11]:
string_data[0]= 1

In [12]:
string_data

0            1
1    artichoke
2          NaN
3      avocado
dtype: object

In [13]:
string_data.fillna

<bound method Series.fillna of 0            1
1    artichoke
2          NaN
3      avocado
dtype: object>

In [14]:
from numpy import nan as NA

In [15]:
data = pd.Series([1,NA,3.5,NA,7])

In [20]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [27]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [29]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],
                   [NA,NA,NA],[NA,6.5,3.]])

In [30]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [37]:
cleaned = data.dropna(how='all')

In [38]:
cleaned

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [39]:
data[1] = NA

In [40]:
data

     0   1    2
0  1.0 NaN  3.0
1  1.0 NaN  NaN
2  NaN NaN  NaN
3  NaN NaN  3.0

In [41]:
data.dropna(axis=1,how='all')

     0    2
0  1.0  3.0
1  1.0  NaN
2  NaN  NaN
3  NaN  3.0

In [44]:
data2 = pd.DataFrame(np.random.randn(7,3))

In [48]:
data2.iloc[:4,1] =NA

In [50]:
data2.iloc[:2,2] = NA

In [51]:
data2

          0         1         2
0 -1.774086       NaN       NaN
1  0.967713       NaN       NaN
2 -0.778559       NaN  1.232735
3 -0.340781       NaN  0.992676
4 -0.835914 -0.836357 -0.740297
5  0.665659 -1.515476  0.278934
6  1.603884  0.535949 -0.025552

In [52]:
data2.dropna()

          0         1         2
4 -0.835914 -0.836357 -0.740297
5  0.665659 -1.515476  0.278934
6  1.603884  0.535949 -0.025552

In [53]:
data2.dropna(thresh=2)

          0         1         2
2 -0.778559       NaN  1.232735
3 -0.340781       NaN  0.992676
4 -0.835914 -0.836357 -0.740297
5  0.665659 -1.515476  0.278934
6  1.603884  0.535949 -0.025552

In [55]:
data2.fillna(0)

          0         1         2
0 -1.774086  0.000000  0.000000
1  0.967713  0.000000  0.000000
2 -0.778559  0.000000  1.232735
3 -0.340781  0.000000  0.992676
4 -0.835914 -0.836357 -0.740297
5  0.665659 -1.515476  0.278934
6  1.603884  0.535949 -0.025552

In [56]:
data2.fillna({1:0.5,2:0})

          0         1         2
0 -1.774086  0.500000  0.000000
1  0.967713  0.500000  0.000000
2 -0.778559  0.500000  1.232735
3 -0.340781  0.500000  0.992676
4 -0.835914 -0.836357 -0.740297
5  0.665659 -1.515476  0.278934
6  1.603884  0.535949 -0.025552

In [57]:
_ = data2.fillna(0, inplace = True)

In [58]:
data2

          0         1         2
0 -1.774086  0.000000  0.000000
1  0.967713  0.000000  0.000000
2 -0.778559  0.000000  1.232735
3 -0.340781  0.000000  0.992676
4 -0.835914 -0.836357 -0.740297
5  0.665659 -1.515476  0.278934
6  1.603884  0.535949 -0.025552

In [61]:
data = pd.DataFrame({'k1': ['one','two'] *3 + ['two'],
                    'k2': [1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [63]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [64]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [65]:
data['v1'] = range(7)

In [67]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [68]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [69]:
data.drop_duplicates(['k1','k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6